EKSİK VERİLER(MISSING DATA-KAYIP VERİ)

In [220]:
import numpy as np
import pandas as pd

In [221]:
#Hava Durumları İle İlgili Bir DataFrame Oluşturalım

In [222]:
weatherForecastDic={"İstanbul":[30,29,np.nan,28],
                    "Ankara":[20,np.nan,25,21],
                    "İzmir":[35,32,29,31],
                    "Antalya":[32,np.nan,34,np.nan]}

In [223]:
weatherForecastDataFrame=pd.DataFrame(weatherForecastDic)

In [224]:
weatherForecastDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     35     32.0
1      29.0     NaN     32      NaN
2       NaN    25.0     29     34.0
3      28.0    21.0     31      NaN

In [225]:
#eğer row bazlı olarak nan değer içerenleri kaldırmak istersek

In [226]:
weatherForecastDataFrame.dropna()#bununla nan değer içerinleri kaldırırız(row bazlı olarak)

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     35     32.0

In [227]:
#eğer kolon bazlı nan değerleri içeren kolonları kaldırmak istersek

In [228]:
weatherForecastDataFrame.dropna(axis=1)

   İzmir
0     35
1     32
2     29
3     31

In [229]:
#aynı verileri içeren yeni bir dataframe oluşturalım

In [230]:
weatherForecastDataFrame2=pd.DataFrame(weatherForecastDic)

In [231]:
weatherForecastDataFrame2

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     35     32.0
1      29.0     NaN     32      NaN
2       NaN    25.0     29     34.0
3      28.0    21.0     31      NaN

In [232]:
#eğer kolonlarda 2 ve üzeri nan değer içeren varsa sadece onları kaldırmak için:

In [233]:
weatherForecastDataFrame2.dropna(axis=1,thresh=max(2,3))#burada thresh=2 işe yaramadı 
#thresh yani kaça kadar anlımında kullanılmaktadır

   İstanbul  Ankara  İzmir
0      30.0    20.0     35
1      29.0     NaN     32
2       NaN    25.0     29
3      28.0    21.0     31

In [234]:
#Eğer boş değerlerin hepsine toplu bir değer ataması gerçekleştirmek istiyorsak:

In [235]:
weatherForecastDataFrame.fillna(25)
#burada hepsine aynı değeri atamak yerine o kolonun ortalamasını hesaplayıp ,boş değerlere kolonların ortalamasıni baz alarak
#atama yapmamız gerekmez mi??--->Peki bunu nasıl yapacağız

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     35     32.0
1      29.0    25.0     32     25.0
2      25.0    25.0     29     34.0
3      28.0    21.0     31     25.0

GROPU BY --->GRUPLANDIRMAK

rowları gruplar
Sözlükten dataframe aktarmak kolay oluyor

In [236]:
#group by alternatifi multi indextir ancak eğer büyük bir veri seti 
#üzerinde çalışıyorsak multi indekleme işlemi uzun zaman alabilir
#bunun için group bu kullanılır

In [237]:
#önce yeni bir dataframe oluşturmadan önce bir dic oluşturalım
salaryDic={"Department":["Yazılım","Yazılım","Pazarlama","Pazarlama","İK","İK"],
          "Worker Name":["Ahmet","Mehmet","Atıl","Burak","Zeynep","Fatma"],
          "Salary":[5000,6000,4500,3500,3000,2500]}

In [238]:
salaryDataFrame=pd.DataFrame(salaryDic)

In [239]:
salaryDataFrame

  Department Worker Name  Salary
0    Yazılım       Ahmet    5000
1    Yazılım      Mehmet    6000
2  Pazarlama        Atıl    4500
3  Pazarlama       Burak    3500
4         İK      Zeynep    3000
5         İK       Fatma    2500

In [240]:
#eğer departman bazlı olarak satırları gruplamak istersek

In [241]:
salaryDataFrameGroupBy=salaryDataFrame.groupby("Department")#-->DataFrameGroupBy object oluşturuldu

In [242]:
salaryDataFrameGroupBy#bu bir nesne olduğundan çıktı olarak bir nesne veriyor

In [243]:
dir(salaryDataFrameGroupBy)

['Department',
 'Salary',
 '__annotations__',
 '__class__',
 '__class_getitem__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__orig_bases__',
 '__parameters__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slots__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_agg_examples_doc',
 '_agg_general',
 '_agg_py_fallback',
 '_aggregate_frame',
 '_aggregate_item_by_item',
 '_aggregate_with_numba',
 '_apply_allowlist',
 '_apply_filter',
 '_apply_to_column_groupbys',
 '_ascending_count',
 '_bool_agg',
 '_can_use_transform_fast',
 '_choose_path',
 '_concat_objects',
 '_constructor',
 '_cumcount_array',
 '_cython_agg_general',
 '_cython_transform',
 '_define_paths',
 '_descending_count',
 '_dir_additions',
 '_dir_deletions',
 '_fill',
 '_get_cythonized_result',
 '_get_data_to_aggregate',
 '_get_index',
 '_get_indices',
 '_gotitem',
 '_group_selection',
 '_group_selection_context',
 '_hidden_attrs',
 '_indexed_output_to_ndframe',
 '_insert_inaxis_grouper_inplace',
 '_internal_names',
 '_internal_names_set',
 '_is_protocol',
 '_iterate_column_groupbys',
 '_iterate_slices',
 '_make_mask_from_int',
 '_make_mask_from_list',
 '_make_mask_from_positional_indexer',
 '_make_mask_from_slice',
 '_make_mask_from_tuple',
 '_make_wrapper',
 '_mask_selected_obj',
 '_numba_agg_general',
 '_numba_prep',
 '_obj_1d_constructor',
 '_obj_with_exclusions',
 '_positional_selector',
 '_python_agg_general',
 '_python_apply_general',
 '_reindex_output',
 '_reset_cache',
 '_reset_group_selection',
 '_resolve_numeric_only',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_set_group_selection',
 '_set_result_index_ordered',
 '_transform',
 '_transform_general',
 '_transform_item_by_item',
 '_transform_with_numba',
 '_wrap_agged_manager',
 '_wrap_aggregated_output',
 '_wrap_applied_output',
 '_wrap_applied_output_series',
 '_wrap_transform_fast_result',
 '_wrap_transformed_output',
 'agg',
 'aggregate',
 'all',
 'any',
 'apply',
 'backfill',
 'bfill',
 'boxplot',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'dtypes',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max',
 'mean',
 'median',
 'min',
 'ndim',
 'ngroup',
 'ngroups',
 'nth',
 'nunique',
 'ohlc',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'prod',
 'quantile',
 'rank',
 'resample',
 'rolling',
 'sample',
 'sem',
 'shift',
 'size',
 'skew',
 'std',
 'sum',
 'tail',
 'take',
 'transform',
 'tshift',
 'value_counts',
 'var']

In [244]:
salaryDataFrameGroupBy.count()

            Worker Name  Salary
Department
Pazarlama             2       2
Yazılım               2       2
İK                    2       2

In [245]:
salaryDataFrameGroupBy.mean()#bu metot ile ortalama maaş değerleri hesaplanır

            Salary
Department
Pazarlama   4000.0
Yazılım     5500.0
İK          2750.0

In [246]:
#eğer departman bazlı olarak max ve min maaşları getirmek istersek

In [247]:
salaryDataFrameGroupBy.max()

           Worker Name  Salary
Department
Pazarlama        Burak    4500
Yazılım         Mehmet    6000
İK              Zeynep    3000

In [248]:
salaryDataFrameGroupBy.min()

           Worker Name  Salary
Department
Pazarlama         Atıl    3500
Yazılım          Ahmet    5000
İK               Fatma    2500

In [249]:
#yukarıdaki bilgilerin hepsini ayrı ayrı yazdırmak yerine 
#hepsini sadece bir metotla yazdırabiliriz

In [250]:
salaryDataFrameGroupBy.describe()#--->statndart sapma,ortalama,yüzdelik dilimleri
#max ve min değerleri getirilir
#describe:betimelemek,tanımlamak

           Salary
            count    mean         std     min     25%     50%     75%     max
Department
Pazarlama     2.0  4000.0  707.106781  3500.0  3750.0  4000.0  4250.0  4500.0
Yazılım       2.0  5500.0  707.106781  5000.0  5250.0  5500.0  5750.0  6000.0
İK            2.0  2750.0  353.553391  2500.0  2625.0  2750.0  2875.0  3000.0

CONCAT

In [251]:
#bu metodun uygulanabilmesi için dataframelerin tüm kolonları aynı olmalıdır

In [252]:
dataFrameDic1={"Name":["Ahmet","Mehmet","Zeynep","Atıl"],
              "Spor":["Yürüyüş","Yüzme","Koşu","Basketbol"],
              "Calori":[100,200,250,150]}

In [253]:
dataFrameDic2={"Name":["Osman","Levent","Atlas","Fatma"],
              "Spor":["Yürüyüş","Yüzme","Koşu","Basketbol"],
              "Calori":[100,200,250,150]}

In [254]:
dataFrameDic3={"Name":["Ayşe","Mahmut","Duygu","Nur"],
              "Spor":["Yürüyüş","Yüzme","Koşu","Basketbol"],
              "Calori":[100,200,250,150]}

In [255]:
#şimdi bu dic -->dataframe işlemi gerçekleştirelim

In [256]:
dataFrame1=pd.DataFrame(data=dataFrameDic1,index=[0,1,2,3])

In [257]:
dataFrame2=pd.DataFrame(data=dataFrameDic2,index=[4,5,6,7])

In [258]:
dataFrame3=pd.DataFrame(data=dataFrameDic3,index=[8,9,10,11])

In [259]:
dataFrame1

     Name       Spor  Calori
0   Ahmet    Yürüyüş     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     250
3    Atıl  Basketbol     150

In [260]:
dataFrame2

     Name       Spor  Calori
4   Osman    Yürüyüş     100
5  Levent      Yüzme     200
6   Atlas       Koşu     250
7   Fatma  Basketbol     150

In [261]:
dataFrame3

      Name       Spor  Calori
8     Ayşe    Yürüyüş     100
9   Mahmut      Yüzme     200
10   Duygu       Koşu     250
11     Nur  Basketbol     150

In [262]:
#şimdi bu 3 dataframe concat işlemi ile birleştirelim

In [263]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])#parametre giriş yerleri önemli

      Name       Spor  Calori
0    Ahmet    Yürüyüş     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     250
3     Atıl  Basketbol     150
4    Osman    Yürüyüş     100
5   Levent      Yüzme     200
6    Atlas       Koşu     250
7    Fatma  Basketbol     150
8     Ayşe    Yürüyüş     100
9   Mahmut      Yüzme     200
10   Duygu       Koşu     250
11     Nur  Basketbol     150

In [264]:
pd.concat([dataFrame2,dataFrame3,dataFrame1])

      Name       Spor  Calori
4    Osman    Yürüyüş     100
5   Levent      Yüzme     200
6    Atlas       Koşu     250
7    Fatma  Basketbol     150
8     Ayşe    Yürüyüş     100
9   Mahmut      Yüzme     200
10   Duygu       Koşu     250
11     Nur  Basketbol     150
0    Ahmet    Yürüyüş     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     250
3     Atıl  Basketbol     150

MERGE

In [265]:
#eğer en az bir ortak kolona sahip fakat tüm kolonları aynı olmayan 
#kolonları birleştirmek istersek bunun için merge metodunu kullanırız

In [266]:
mergeDic1={"Name":["Ahmet","Mehmet","Zeynep","Atıl"],
          "Spor":["Yürüyüş","Yüzme","Koşu","Basketbol"]}

In [267]:
mergeDic2={"Name":["Ahmet","Mehmet","Zeynep","Atıl"],
          "Calori":[100,200,250,150]}

In [268]:
#dic-->dataframe işlemini gerçekleştirelim

In [269]:
mergeDataFrame1=pd.DataFrame(data=mergeDic1)

In [270]:
mergeDataFrame1

     Name       Spor
0   Ahmet    Yürüyüş
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [271]:
mergeDataFrame2=pd.DataFrame(data=mergeDic2)

In [272]:
mergeDataFrame2

     Name  Calori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     250
3    Atıl     150

In [273]:
#bu iki dataframede Name kolonları aynı
#bu kolonları baz alarak merge işlemini gerçekleştirelim

Kullanımı:
    pd.merge(birleştirilecek 1.dataframe,2.dataframe,on="ortak kolon adı")

In [274]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Name")

     Name       Spor  Calori
0   Ahmet    Yürüyüş     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     250
3    Atıl  Basketbol     150

PANDAS İLERİ SEVİYE OPERASYONLAR

In [275]:
salaryDic={"Name":["Atıl","Zeynep","Ahmet","Mehmet"],
          "Departmant":["Yazılım","Satış","Pazarlama","Yazılım"],
          "Salary":[200,300,400,500]}

In [276]:
#dic--->dataframe işlemini gerçeklştirelim

In [277]:
salaryDataFrame=pd.DataFrame(salaryDic)

In [278]:
salaryDataFrame

     Name Departmant  Salary
0    Atıl    Yazılım     200
1  Zeynep      Satış     300
2   Ahmet  Pazarlama     400
3  Mehmet    Yazılım     500

In [279]:
#eğer bu dataframe de departmanlar üzerinde tekilleştirme işlemi gerçekleşitrmek istersek

In [280]:
salaryDataFrame["Departmant"].unique()#burada tekilleştirme işlemini gerçekleştirerek
#bu bilgileri bir arraye atıyor(array fonk kullanabiliriz demektir)

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [281]:
#eğer tekilleştirme işlemi sonucunda departman sayısını öğrenmek istersek

In [282]:
salaryDataFrame["Departmant"].nunique()

3

In [283]:
type(salaryDataFrame["Departmant"].nunique())

int

In [284]:
#eğer departmanlara ait değer sayısını toplayop yazdırmak istersek

In [285]:
salaryDataFrame["Departmant"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departmant, dtype: int64

In [286]:
#maaşların vergilerini hesaplayan bir fonk yazarsak

In [287]:
def vergiHesaplama(maas):
    return maas*0.66

In [288]:
#şimdi bu fonksiyonu dataframedeki salary kolonuna uygulayalım

In [289]:
salaryDataFrame["Salary"].apply(vergiHesaplama)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Salary, dtype: float64

In [290]:
#bu tabloda null değer olup olmadığını kontrol etmek için:

In [291]:
salaryDataFrame.isnull()

    Name  Departmant  Salary
0  False       False   False
1  False       False   False
2  False       False   False
3  False       False   False

In [292]:
#eğer multi indexde yaptığımız gibi nir gruplama yapmak istersek
#ama bunu pivot(excelde özet tablo oluşturmak için kullandığımız):

In [293]:
karakterDic={"Karakter Sınıfı":["Marvel","Marvel","DC","DC"],
           "Karakter İsmi":["Spiderman","Ironma","Superman","Batman"],
           "Karakter Yas":[23,2,32,43]}
karakterDF=pd.DataFrame(karakterDic)

In [294]:
karakterDF

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0          Marvel     Spiderman            23
1          Marvel        Ironma             2
2              DC      Superman            32
3              DC        Batman            43

In [295]:
#pivot kullanarak gruplandırma işlemi

In [296]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter İsmi"])

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
DC              Batman                   43
                Superman                 32
Marvel          Ironma                    2
                Spiderman                23

EXCELLE ÇALIŞMAK

bunun için önce jupyter ile yazılam defterlerle aynı dizinde bir excel tablosu tanımlamamız lazım sonra bu excel dosyası içindeki bilgileri okumak için:
excelDataFrame= pd.read_excel("dosya adi.xlsx") yazmamız lazım
sonra excelDataFrame üzerinde yaptığımız değişiklikleri başka bir excel dosyasına kaydetmek için:
excelDataFrame.to_excel("Dosyaadi.xlsx") komutunu yazmamız gerekir


eğer excel dosyası csv formatında ise yani veriler kolonla değilde virgülle ayrılmışsa o dosyayı okumak için:
read_csv
yapılan değişiklikleri başka bir dosyaya kaydetmek için:
to_csv fonk kullanılır